Revit 2027 API
CategoryNameMap.ForwardIterator Method
Retrieve a forward moving iterator to the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual CategoryNameMapIterator ForwardIterator()
Public Overridable Function ForwardIterator As CategoryNameMapIterator
public:
virtual CategoryNameMapIterator^ ForwardIterator()
abstract ForwardIterator : unit -> CategoryNameMapIterator
override ForwardIterator : unit -> CategoryNameMapIterator
Return Value
CategoryNameMapIterator
Returns a forward moving iterator to the map.
See Also
Reference
CategoryNameMap Class
Autodesk.Revit.DB Namespace